Revit 2027 API
BuiltInFailures.CopyPasteFailures.CannotCopyNoParents Property
 Can't Copy to Clipboard because of relationships between Elements
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCopyNoParents { get; }
Public Shared ReadOnly Property CannotCopyNoParents As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCopyNoParents {
	FailureDefinitionId^ get ();
}
static member CannotCopyNoParents : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace